_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ПрефиксыРасценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ПрефиксыРасценок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегиональнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ПрефиксыРасценок/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ПрефиксыРасценок.Ссылка
		                      |ИЗ
		                      |	Справочник.СМ_ПрефиксыРасценок КАК ПрефиксыРасценок
		                      |ГДЕ
		                      |	ПрефиксыРасценок.ТипНормативногоСборника = &ТипНормативногоСборника
		                      |	И ПрефиксыРасценок.Ссылка <> &Ссылка");
		Запрос.УстановитьПараметр("ТипНормативногоСборника", ЭтотОбъект.ТипНормативногоСборника);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Группа с типом нормативного сборника: %1 уже существует'"), ЭтотОбъект.ТипНормативногоСборника));
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПрефиксыРасценок.Ссылка
		                      |ИЗ
		                      |	Справочник.СМ_ПрефиксыРасценок КАК ПрефиксыРасценок
		                      |ГДЕ
		                      |	ПрефиксыРасценок.Родитель = &Родитель
		                      |	И ПрефиксыРасценок.РегиональнаяБаза = &РегиональнаяБаза
		                      |	И ПрефиксыРасценок.Ссылка <> &Ссылка");
		Запрос.УстановитьПараметр("Родитель", ЭтотОбъект.Родитель);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("РегиональнаяБаза", ЭтотОбъект.РегиональнаяБаза);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Элемент с региональной базой: %1 уже существует в группе: %2'"), ЭтотОбъект.РегиональнаяБаза, ЭтотОбъект.Родитель));
		КонецЕсли;
		ЭтотОбъект.ТипНормативногоСборника = ЭтотОбъект.Родитель.ТипНормативногоСборника;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
